<?php

use App\Location;
use Illuminate\Database\Seeder;

class LocationSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $locations = [
            [
                'id'             => 1,
                'name'           => 'ПС 110кВ Погружная',
            ],
            [
                'id'             => 2,
                'name'           => 'ПС 110кВ Янтарная',
            ],
            [
                'id'             => 3,
                'name'           => 'ПС 110кВ Еты-Пур',
            ],
            [
                'id'             => 4,
                'name'           => 'ПС 110кВ Новогодняя',
            ],
            [
                'id'             => 5,
                'name'           => 'ПС 110кВ Сугмутская',
            ],
            [
                'id'             => 6,
                'name'           => 'ПС 110кВ Геращенко',
            ],
            [
                'id'             => 7,
                'name'           => 'ПС 110кВ Жемчужина',
            ],
            [
                'id'             => 8,
                'name'           => 'ПС 110кВ Курская',
            ],
            [
                'id'             => 9,
                'name'           => 'ПС 110кВ Орловская',
            ],
            [
                'id'             => 10,
                'name'           => 'ПС 110кВ Пяку-Пур',
            ],
            [
                'id'             => 11,
                'name'           => 'ПС 110кВ Городская',
            ],
            [
                'id'             => 12,
                'name'           => 'ПС 110кВ Комплект',
            ],
            [
                'id'             => 13,
                'name'           => 'ПС 110кВ КНС-9',
            ],
            [
                'id'             => 14,
                'name'           => 'ПС 110кВ Крайняя',
            ],
            [
                'id'             => 15,
                'name'           => 'ПС 110кВ Суторминская',
            ],
            [
                'id'             => 16,
                'name'           => 'ПС 110кВ Трудовая',
            ],
            [
                'id'             => 17,
                'name'           => 'ПС 220кВ Пуль-Яха',
            ],
            [
                'id'             => 18,
                'name'           => 'ПС 110кВ Вынгаяхинская',
            ],
            [
                'id'             => 19,
                'name'           => 'ПС 110кВ Стрела',
            ],
            [
                'id'             => 20,
                'name'           => 'ПС 110кВ Ударная',
            ],
            [
                'id'             => 21,
                'name'           => 'ПС 110кВ Вышка',
            ],
            [
                'id'             => 22,
                'name'           => 'ПС 110кВ Западно-Ноябрьская',
            ],
            [
                'id'             => 23,
                'name'           => 'ПС 110кВ Карамовская',
            ],
            [
                'id'             => 24,
                'name'           => 'ПС 110кВ КНС-1',
            ],
            [
                'id'             => 25,
                'name'           => 'ПС 110кВ Разряд',
            ],
            [
                'id'             => 26,
                'name'           => 'ПС 110кВ Ярайнерская',
            ],
            [
                'id'             => 27,
                'name'           => 'ПС 110кВ Хорошуновская',
            ],
            [
                'id'             => 28,
                'name'           => 'ПС 110кВ Снежная',
            ],
            [
                'id'             => 29,
                'name'           => 'ПС 110кВ Итурская',
            ],
            [
                'id'             => 30,
                'name'           => 'ПС 110кВ Звездная',
            ],
            [
                'id'             => 31,
                'name'           => 'ПС 110кВ Отдельная',
            ],
            [
                'id'             => 32,
                'name'           => 'ПС 110кВ Хрустальная',
            ],
            [
                'id'             => 33,
                'name'           => 'ПС 220кВ Янга-Яха',
            ],
            [
                'id'             => 34,
                'name'           => 'ПС 500кВ Холмогорская',
            ],
            [
                'id'             => 35,
                'name'           => 'ПС 110/35/6кВ Чуркинская',
            ],
        ];

        Location::insert($locations);
    }
}
