<?php

use App\Mpoint;
use Illuminate\Database\Seeder;

class PointSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $points = [
            [
                'id'             => 1,
                'name'           => 'ПС 110кВ Погружная, ОРУ-35кВ, 1 СШ, ВЛ-35кВ Куст 17-1',
                'location_id'    => 1,
            ],
            [
                'id'             => 2,
                'name'           => 'ПС 110кВ Погружная, ОРУ-35кВ, 1 СШ, ВЛ-35кВ Куст 31-1',
                'location_id'    => 1,
            ],
            [
                'id'             => 3,
                'name'           => 'ПС 110кВ Погружная, ОРУ-35кВ, 2 СШ, ВЛ-35кВ Куст 17-2',
                'location_id'    => 1,
            ],
            [
                'id'             => 4,
                'name'           => 'ПС 110кВ Погружная, ОРУ-35кВ, 2 СШ, ВЛ-35кВ Куст 31-2',
                'location_id'    => 1,
            ],
            [
                'id'             => 5,
                'name'           => 'ПС 110кВ Погружная, ЗРУ-6кВ, 1 СШ, яч.11',
                'location_id'    => 1,
            ],
            [
                'id'             => 6,
                'name'           => 'ПС 110кВ Погружная, ТСН-1, РУ-0,4кВ',
                'location_id'    => 1,
            ],
            [
                'id'             => 7,
                'name'           => 'ПС 110кВ Погружная, ЗРУ-6кВ, 2 СШ, яч.4',
                'location_id'    => 1,
            ],
            [
                'id'             => 8,
                'name'           => 'ПС 110кВ Погружная, ТСН-2, РУ-0,4кВ',
                'location_id'    => 1,
            ],
            [
                'id'             => 9,
                'name'           => 'ПС 110кВ Янтарная, РУ-35кВ, 1 СШ, ВЛ-35кВ Промзона-1',
                'location_id'    => 2,
            ],
            [
                'id'             => 10,
                'name'           => 'ПС 110кВ Янтарная, РУ-35кВ, 1 СШ, ВЛ-35кВ Куст 78-1',
                'location_id'    => 2,
            ],
            [
                'id'             => 11,
                'name'           => 'ПС 110кВ Янтарная, РУ-35кВ, 1 СШ, ВЛ-35кВ Куст 53-1',
                'location_id'    => 2,
            ],
            [
                'id'             => 12,
                'name'           => 'ПС 110кВ Янтарная, РУ-35кВ, 2 СШ, ВЛ-35кВ Промзона-2',
                'location_id'    => 2,
            ],
            [
                'id'             => 13,
                'name'           => 'ПС 110кВ Янтарная, РУ-35кВ, 2 СШ, ВЛ-35кВ Куст 78-2',
                'location_id'    => 2,
            ],
            [
                'id'             => 14,
                'name'           => 'ПС 110кВ Янтарная, РУ-35кВ, 2 СШ, ВЛ-35кВ Куст 53-2',
                'location_id'    => 2,
            ],
            [
                'id'             => 15,
                'name'           => 'ПС 110кВ Янтарная, 3РУ-6кВ, 1 СШ, яч.18',
                'location_id'    => 2,
            ],
            [
                'id'             => 16,
                'name'           => 'ПС 110кВ Янтарная, ТСН-1, РУ-0,4кВ',
                'location_id'    => 2,
            ],
            [
                'id'             => 17,
                'name'           => 'ПС 110кВ Янтарная, 3РУ-6кВ, 2 СШ, яч.9',
                'location_id'    => 2,
            ],
            [
                'id'             => 18,
                'name'           => 'ПС 110кВ Янтарная, ТСН-2, РУ-0,4кВ',
                'location_id'    => 2,
            ],
            [
                'id'             => 19,
                'name'           => 'ПС 110кВ Еты-Пур, 3РУ-6кВ, 1 СШ, яч.16',
                'location_id'    => 3,
            ],
            [
                'id'             => 20,
                'name'           => 'ПС 110кВ Еты-Пур, ТСН-1, РУ-0,4кВ',
                'location_id'    => 3,
            ],
            [
                'id'             => 21,
                'name'           => 'ПС 110кВ Еты-Пур, 3РУ-6кВ, 2 СШ, яч.8',
                'location_id'    => 3,
            ],
            [
                'id'             => 22,
                'name'           => 'ПС 110кВ Еты-Пур, ТСН-2, РУ-0,4кВ',
                'location_id'    => 3,
            ],
        ];
        Mpoint::insert($points);
    }
}
